
## Plan Result

[CI link](https://github.com/hawk0616/recruit-service-board-infla/actions/runs/6219023308)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * aws_security_group.rds is tainted, so


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_security_group.rds is tainted, so must be replaced
-/+ resource "aws_security_group" "rds" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-1:113713103169:security-group/sg-03e5a7f663f33a204" -> (known after apply)
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      ~ id                     = "sg-03e5a7f663f33a204" -> (known after apply)
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow MySQL from ECS security group"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-01392c715b6f27337",
                ]
              + self             = false
              + to_port          = 3306
            },
        ]
        name                   = "recruit-service-board-rds"
      + name_prefix            = (known after apply)
      ~ owner_id               = "113713103169" -> (known after apply)
        tags                   = {
            "Name" = "recruit-service-board-rds"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":7,"Program":"tfcmt","SHA1":"f605665e31c70557c5299904382155b011e46364","Vars":{},"WorkflowName":"Terraform"} -->